Repository: kurrsat/VitaTrack-kilo-takip-uygulamasi-
Catalog: sutakipuygulmasii/lib/l10n/app_*.arb
Languages: tr

# appTitle
source: Water Reminder
tr: Su Hatırlatıcı

source: Onboarding
tr: Tanıtım

source: Home
tr: Ana Sayfa

source: Hydration
tr: Hidrasyon

source: Reminders
tr: Hatırlatıcılar

# stats
source: Statistics
tr: İstatistikler

source: Settings
tr: Ayarlar

# settingsProfile
source: Profile
tr: Profil

# settingsProfileSubtitle
source: Edit your weight and activity level
tr: Kilo ve aktivite seviyeni düzenle

# settingsGoal
source: Daily Goal
tr: Günlük Hedef

# settingsGoalSubtitle
source: Adjust your water intake target
tr: Su içme hedefini ayarla

# settingsReminders
source: Reminder Settings
tr: Hatırlatıcı Ayarları

# settingsRemindersSubtitle
source: Configure notification schedule
tr: Bildirim zamanlamasını yapılandır

# settingsCups
source: Cup Presets
tr: Bardak Önayarları

# settingsCupsSubtitle
source: Manage quick-add cup sizes
tr: Hızlı ekleme boyutlarını yönet

# settingsNotifications
source: Test Notifications
tr: Bildirimleri Test Et

# settingsNotificationsSubtitle
source: Debug notification system
tr: Bildirim sistemini kontrol et

# settingsData
source: Data Management
tr: Veri Yönetimi

# settingsDataSubtitle
source: Export, restore, or reset data
tr: Verileri dışa aktar, geri yükle veya sıfırla

# settingsPremium
source: Premium Features
tr: Premium Özellikler

# settingsPremiumSubtitle
source: Unlock advanced features
tr: Gelişmiş özelliklerin kilidini aç

# settingsHelp
source: Help & Troubleshooting
tr: Yardım ve Sorun Giderme

# settingsHelpSubtitle
source: Get support and tips
tr: Destek ve ipuçları al

# settingsPrivacy
source: Privacy Policy
tr: Gizlilik Politikası

# settingsPrivacySubtitle
source: How we handle your data
tr: Verilerinizi nasıl işliyoruz

# goalAuto
source: Automatic (Recommended)
tr: Otomatik (Önerilen)

# goalManual
source: Manual Override
tr: Manuel Ayar

# goalCalculated
source: Calculated based on your profile
tr: Profilinize göre hesaplanıyor

source: Reminder Mode
tr: Hatırlatıcı Modu

# reminderModeInterval
source: Equal Intervals
tr: Eşit Aralıklar

# reminderModeFixed
source: Fixed Times
tr: Sabit Zamanlar

# reminderDays
source: Active Days
tr: Aktif Günler

# reminderQuietHours
source: Quiet Hours
tr: Sessiz Saatler

# reminderSnooze
source: Snooze Duration
tr: Erteleme Süresi

# reminderTodayOff
source: Pause Today
tr: Bugün Duraklat

# reminderTodayOffDesc
source: Disable reminders for today only
tr: Sadece bugün için hatırlatıcıları devre dışı bırak

source: Export Data
tr: Verileri Dışa Aktar

# exportDataDesc
source: Save your data to a file
tr: Verilerinizi dosyaya kaydedin

source: Restore Data
tr: Verileri Geri Yükle

# restoreDataDesc
source: Import data from backup
tr: Yedekten verileri içe aktarın

source: Reset All Data
tr: Tüm Verileri Sıfırla

# resetAllDataDesc
source: Delete everything and start fresh
tr: Her şeyi sil ve sıfırdan başla

# resetConfirmTitle
source: Reset All Data?
tr: Tüm Veriler Silinsin mi?

# resetConfirmMessage
source: This will permanently delete all your water logs, settings, and achievements. This action cannot be undone.
tr: Bu işlem tüm su kayıtlarınızı, ayarlarınızı ve rozetlerinizi kalıcı olarak silecektir. Bu işlem geri alınamaz.

source: Cancel
tr: İptal

source: Reset
tr: Sıfırla

# helpTitle
source: Help & Troubleshooting
tr: Yardım ve Sorun Giderme

# helpNotificationsTitle
source: Notifications Not Working?
tr: Bildirimler Gelmiyor mu?

# helpNotificationsIos
source: iOS: Go to Settings → Water Reminder → Notifications and enable all options
tr: iOS: Ayarlar → Su Hatırlatıcı → Bildirimler'e gidin ve tüm seçenekleri etkinleştirin

# helpNotificationsAndroid
source: Android: Ensure the app has notification permissions and disable battery optimization
tr: Android: Uygulamanın bildirim izinlerinin olduğundan ve pil optimizasyonunun devre dışı olduğundan emin olun

# helpFaqTitle
source: Frequently Asked Questions
tr: Sık Sorulan Sorular

# helpFaq1Q
source: How is my daily goal calculated?
tr: Günlük hedefim nasıl hesaplanıyor?

# helpFaq1A
source: Your goal is based on your weight and activity level: Weight (kg) × Activity Factor (30-50 ml/kg)
tr: Hedefiniz kilo ve aktivite seviyenize göre hesaplanır: Kilo (kg) × Aktivite Faktörü (30-50 ml/kg)

# helpFaq2Q
source: What happens during timezone changes?
tr: Saat dilimi değişikliklerinde ne olur?

# helpFaq2A
source: The app automatically detects timezone changes and reschedules your reminders to maintain correct timing
tr: Uygulama saat dilimi değişikliklerini otomatik algılar ve doğru zamanlamayı korumak için hatırlatıcılarınızı yeniden planlar

# helpFaq3Q
source: Can I customize reminder sounds?
tr: Hatırlatıcı seslerini özelleştirebilir miyim?

# helpFaq3A
source: Notification sounds are controlled by your device's system settings for this app
tr: Bildirim sesleri cihazınızın sistem ayarlarından bu uygulama için kontrol edilir

# privacyTitle
source: Privacy Policy
tr: Gizlilik Politikası

# privacyLocalStorage
source: Your Data Stays on Your Device
tr: Verileriniz Cihazınızda Kalır

# privacyLocalStorageDesc
source: All your water intake logs, settings, and personal information are stored locally on your device. We do not collect, transmit, or store any of your data on external servers.
tr: Tüm su içme kayıtlarınız, ayarlarınız ve kişisel bilgileriniz cihazınızda yerel olarak saklanır. Verilerinizden hiçbirini harici sunucularda toplamaz, iletmez veya saklamayız.

# privacyNoTracking
source: No Tracking or Analytics
tr: İzleme veya Analitik Yok

# privacyNoTrackingDesc
source: This app does not use any analytics, tracking, or advertising services. Your usage patterns and personal data remain completely private.
tr: Bu uygulama hiçbir analitik, izleme veya reklam hizmeti kullanmaz. Kullanım alışkanlıklarınız ve kişisel verileriniz tamamen gizli kalır.

# privacyPermissions
source: Permissions Explained
tr: İzinler Açıklaması

# privacyPermissionsDesc
source: • Notifications: To remind you to drink water • Storage: To save your data locally • Exact Alarms: To schedule precise reminders
tr: • Bildirimler: Su içmenizi hatırlatmak için • Depolama: Verilerinizi yerel olarak kaydetmek için • Tam Alarmlar: Hassas hatırlatıcılar planlamak için

source: Save
tr: Kaydet

source: Edit
tr: Düzenle

source: Delete
tr: Sil

source: Done
tr: Tamam
