Repository: kurrsat/VitaTrack-kilo-takip-uygulamasi-
Catalog: meallog/lib/l10n/app_*.arb
Languages: tr

source: Today
tr: Bug�n

source: Search
tr: Ara

source: Settings
tr: Ayarlar

source: Breakfast
tr: Kahvalt�

source: Lunch
tr: ��le Yeme�i

source: Dinner
tr: Ak�am Yeme�i

source: Snack
tr: Ara ���n

source: Calories
tr: Kalori

source: Carbs
tr: Karbonhidrat

source: Fat
tr: Ya�

source: Add
tr: Ekle

source: Add Food
tr: Yiyecek Ekle

source: Portion
tr: Porsiyon

source: Grams
tr: Gram

# searchHint
source: Search foods (e.g. tomato)
tr: Yiyecek ara (�r. domates)

source: Recent
tr: Son Kullan�lanlar

source: Favorites
tr: Favoriler

# manualEntry
source: Manual Food
tr: Manuel Yiyecek

# offlineNotice
source: No internet. Showing cached results.
tr: �nternet yok. Cache sonu� g�steriliyor.

# emptySearch
source: No results found.
tr: Sonu� bulunamad�.

source: Total
tr: Toplam

source: Verified
tr: Do�rulanm��

source: Save
tr: Kaydet

source: Cancel
tr: �ptal

source: Edit Entry
tr: Kayd� D�zenle

source: Delete
tr: Sil

source: Entry deleted
tr: Kay�t silindi

source: Undo
tr: Geri Al

source: Notes
tr: Not

# macroShort
source: P/C/F
tr: P/K/Y

# summary
source: Daily Summary
tr: G�n �zeti

# tapToSee
source: Tap to view details
tr: Detaylar� g�rmek i�in dokun

source: Daily Total
tr: G�nl�k Toplam

# noEntries
source: No entries yet.
tr: Hen�z kay�t yok.

source: Try Again
tr: Tekrar Dene

# networkFallback
source: No network, showing sample data.
tr: A� eri�imi yok, �rnek veri g�steriliyor.

source: Brand
tr: Marka

source: Name
tr: �sim

# nameRequired
source: Name is required
tr: �sim gerekli

# kcalPer100g
source: Calories per 100g
tr: 100g Kalori

source: Protein per 100g
tr: 100g Protein

# carbPer100g
source: Carbs per 100g
tr: 100g Karb

source: Fat per 100g
tr: 100g Ya�

source: Add to meal
tr: ���ne Ekle
